IPA_LIST = ['aɪ', 'aʊ', 'b', 'd', 'd͡ʒ', 'eɪ', 'f', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'oʊ', 'p', 's', 't', 't͡ʃ',
            'u', 'v', 'w', 'z', 'æ', 'ð', 'ŋ', 'ɑ', 'ɔ', 'ɔɪ', 'ə', 'ɚ', 'ɛ', 'ɡ', 'ɪ', 'ɹ', 'ʃ', 'ʊ',
            'ʌ', 'ʒ', 'ˈaɪ', 'ˈaʊ', 'ˈeɪ', 'ˈi', 'ˈoʊ', 'ˈu', 'ˈæ', 'ˈɑ', 'ˈɔ', 'ˈɔɪ', 'ˈɚ', 'ˈɛ',
            'ˈɪ', 'ˈʊ', 'ˈʌ', 'ˌaɪ', 'ˌaʊ', 'ˌeɪ', 'ˌi', 'ˌoʊ', 'ˌu', 'ˌæ', 'ˌɑ', 'ˌɔ', 'ˌɔɪ',
            'ˌɚ', 'ˌɛ', 'ˌɪ', 'ˌʊ', 'ˌʌ', 'θ', '"', ' ', '_', '^', '$', '!', '#', "'", '(', ')', ',', '-', '.', ':', ';', '?']

UNICODE_NORM_FORM = "NFKC"

# Add any other utility functions here if needed
